In [14]:
import requests
from bs4 import BeautifulSoup
import pandas as pd

In [15]:
TitleName=[]
Gross=[]
Weekend=[]
Week=[]

In [16]:
response = requests.get('https://www.boxofficemojo.com/year/world/2024', timeout=10)
if response.status_code == 200:
    print('Hi! Explore the BoxofficeMojo Site :)')
else:
    print(f'The error {response.status_code} occurred')

Hi! Explore the BoxofficeMojo Site :)

[]

In [41]:
import requests
from bs4 import BeautifulSoup

Title = []
WorldWide = []
Domestic = []
Foreign = []
Yr=[]

for year in range(2024, 1976, -1):  # Loop from 2024 to 1975
    url = f'https://www.boxofficemojo.com/year/world/{year}/'
    response = requests.get(url)
    html_content = response.text

    soup = BeautifulSoup(html_content, "html.parser")
    tables = soup.find_all("table", class_="mojo-body-table")

    if tables:
        for table in tables:
            rows = table.find_all("tr")
            for row in rows[1:]:  # skipping the header row
                cols = row.find_all("td")
                if len(cols) >= 6:  # Ensure there are enough columns
                    Yr.append(year)
                    Title.append(cols[1].text.strip())  # Index 1 corresponds to the Release Group column
                    WorldWide.append(cols[2].text.strip())   # Index 2 corresponds to the Worldwide column
                    Domestic.append(cols[3].text.strip())  # Index 3 corresponds to the Domestic column
                    Foreign.append(cols[5].text.strip()) # Index 5 corresponds to the Foreign column

                    #print(f"Year: {year}, Title: {title}, WorldWide: {ww}, Domestic: {dom}, Foreign: {foreign}")
                else:
                    print("Some data is missing in this row.")
    else:
        print(f"Table not found for the year {year}")

# Check the length of each list to ensure data consistency
print(len(Yr))
print(len(Title))
print(len(WorldWide))
print(len(Domestic))
print(len(Foreign))

8845
8845
8845
8845
8845

In [42]:
df=pd.DataFrame({'Movie Title':Title, 'World Wide':WorldWide, 'Deomestic':Domestic, 'Foreign':Foreign})
df.to_csv('Boxoffice.csv', index=False)

In [45]:
df

,Movie Title,World Wide,Deomestic,Foreign
0,Dune: Part Two,"$685,338,583","$272,938,583","$412,400,000"
1,Kung Fu Panda 4,"$455,494,113","$174,560,445","$280,933,668"
2,Godzilla x Kong: The New Empire,"$440,262,286","$160,362,286","$279,900,000"
3,Bob Marley: One Love,"$176,976,439","$96,676,439","$80,300,000"
4,Ghostbusters: Frozen Empire,"$160,767,639","$97,767,639","$63,000,000"
...,...,...,...,...
8840,Joseph Andrews,"$839,865","$839,865",-
8841,Citizens Band,"$815,530","$815,530",-
8842,Fraternity Row,"$290,674","$290,674",-
8843,Sorcerer,$651,-,-
8844,1900,$360,-,-